       IDENTIFICATION DIVISION.
        PROGRAM-ID. comments.
       PROCEDURE DIVISION.
           EVALUATE TRUE
               WHEN SBCPU-N88-HMH
                    DISPLAY "ola"
           END-EVALUATE.
