       PROCEDURE DIVISION.
      ********************
      *
      *----------------------------------------------------------------*
       000000-ROTINA-PRINCIPAL                                  SECTION.
      *----------------------------------------------------------------*
      *
       120099-SAI.
           EXIT.
